[
    {
        "title": "Introduction to bookkeeping and accounting",
        "description": "Money & Business",
        "category": "Money & Business",
        "chapters": [
            {
                "title": "Introduction",
                "content": "Introduction to bookkeeping and accounting\nIntroduction\nIn this free course, Introduction to bookkeeping and accounting, we introduce you to the essential skills and concepts of bookkeeping and accounting. To start with you will gain some practical skills in numeracy including learning about rearranging simple equations as well as some important calculator skills. Afterwards, you will gain knowledge and understanding of the fundamental principles that underpin bookkeeping and accounting. You will learn the time-honoured rules of double-entry bookkeeping and also how to prepare a trial balance and the two principal financial statements: the balance sheet (also known as the statement of financial position) and the profit and loss account (also known as the income statement).\nPlease note that this is an untutored course and direct feedback on any incorrect answers given in activities is not provided.\nTell us what you think! We’d love to hear from you to help us improve our free learning offering through OpenLearn by filling out this short survey \n.\nThis OpenLearn course provides a sample of level 1 study in Business & Management.\nYou might be interested in a more recent Open University course, B124 Fundamentals of accounting\nGet careers guidance\nThis course has been included in the National Careers Service  to help you develop new skills."
            },
            {
                "title": "Learning outcomes",
                "content": "Learning outcomes\nAfter studying this course, you should be able to:\nunderstand and apply the essential numerical skills required for bookkeeping and accounting\nunderstand and explain the relationship between the accounting equation and double-entry bookkeeping\nrecord transactions in the appropriate ledger accounts using the double-entry bookkeeping system\nbalance off ledger accounts at the end of an accounting period\nprepare a trial balance, balance sheet and a profit and loss account."
            },
            {
                "title": "1 Essential numerical skills required for bookkeeping and accounting",
                "content": "1 Essential numerical skills required for bookkeeping and accounting\nExpertise in mathematics is not required to succeed as a bookkeeper or an accountant. What is needed, however, is the confidence and ability to be able to add, subtract, multiply, divide as well as use decimals, fractions and percentages. Competent bookkeepers and accountants should be able to use mental calculations as well as a calculator to perform these numerical skills. The ability to use a calculator effectively is as important- as the ability to use a spreadsheet program.\nThe material in this section covers the essential numerical skills of addition, subtraction, multiplication, division, through to decimals, percentages, fractions and negative numbers. You are expected to use a calculator for most of the activities but you are also encouraged to use mental calculations. In the modern world, the assumption is that we use calculators to avoid the tedious process of working out calculations by hand or mentally. The danger, of course, is that you may use a calculator without understanding what an answer means or how it relates to the numbers that have been used. For example, if you calculate that 10% of £90 is £900 (which can easily happen if either you forget to press the per-cent key or it is not pressed hard enough), you should immediately notice that something is very wrong.\nUsing a calculator requires an understanding of what functions the buttons perform and in which order to carry out the calculations. Your need to study this material is dependent on your mathematical background. If you feel weak or rusty on basic arithmetic or maths, you should find this material helpful. The directions and symbols used will be those found on most standard calculators. (If you find that any of the instructions contained in this material do not produce the answer you expected, please follow the instructions of your calculator.)\nThere are four basic operations between numbers, each of which has its own notation:\nAddition 7 + 34 = 41\nSubtraction 34 – 7 = 27\nMultiplication 21 x 3 = 63, or 21 * 3 = 63\nDivision 21 ÷ 3 = 7, or 21 / 3 = 7\nThe next section will examine the application of these operations and the correct presentation of the results arising from them."
            },
            {
                "title": "1.1 Use of BODMAS and brackets",
                "content": "1.1 Use of BODMAS and brackets\nWhen several operations are combined, the order in which they are performed is important. For example, 12 + 21 x 3 might be interpreted in two different ways:\nActivity 1\n(a) add 12 to 21 and then multiply the result by 3\nReveal answer\n(b) multiply 21 by 3 and then add the result to 12\nReveal answer\nAccording to BODMAS, multiplication should always be done before addition, therefore 75 is actually the correct answer according to BODMAS.\n(‘Order’ may be an unfamiliar term to you in this context but it is merely an alternative for the more common term, ‘power’ which means a number is multiplied by itself one or more times. The ‘power’ of one means that a number is multiplied by itself once, i.e., 2 x 1, 3 x 1, etc., the ‘power’ of two means that a number is multiplied by itself twice, i.e., 2 x 2, 3 x 3, etc. In mathematics, however, instead of writing 3 x 3 we write 3 2 and express this as three to the ‘power’ or ‘order’ of 2.)\nBrackets are the first term used in BODMAS and should always be used to avoid any possibility of ambiguity or misunderstanding. A better way of writing 12 + 21 x 3 is thus 12 + (21 x 3). This makes it clear which operation should be done first.\n12 + (21 x 3) is thus done on the calculator by keying in 21 x 3 first in the sequence:\nFigure 1\nActivity 2\nComplete the following calculations.:\nPart (a)\n(a) (13 x 3) + 17\nReveal answer\nPart (b)\n(b) (15 / 5) – 2\nReveal answer\nPart (c)\n(c) (12 x 3) /2\nReveal answer\nPart (d)\n(d) 17 – (3 x (2 + 3))\nReveal answer\nPart (e)\n(e) ((13 + 2) / 3) –4\nReveal answer\nPart (f)\n(f) 13 x (3 + 17)\nReveal answer"
            },
            {
                "title": "1.2 Use of calculator memory",
                "content": "1.2 Use of calculator memory\nA portable calculator is an extremely useful tool for a bookkeeper or an accountant. Although PCs normally have electronic calculators, there is no substitute for the convenience of a small, portable calculator or its equivalent in a mobile phone or personal organiser.\nWhen using the calculator, it is safer to use the calculator memory (M+ on most calculators) whenever possible, especially if you need to do more than one calculation in brackets. The memory calculation will save the results of any bracket calculation and then allow that value to be recalled at the appropriate time. It is always good practice to clear the memory before starting any new calculations involving its use. You do so by pressing the MRC key, representing Memory Recall or its equivalent, twice. (Note: this key is often labelled R.MC or R.CM. The first time the key is pressed memory is recalled and the second time it is cleared. If in doubt about your calculator, consult its manual.)\nFigure 2\nTaking the previous example we can recalculate it using the memory function.\n12 + (21 x 3) = 75\nFigure 3\nActivity 3\nUse the memory on your calculator to calculate each of the following:\nPart (a)\n(a) 6 + (7 – 3)\nReveal answer\nPart (b)\n(b) 14.7 / (0.3 + 4.6)\nReveal answer\nPart (c)\n(c) 7 + (2 x 6)\nReveal answer\nPart (d)\n(d) 0.12 + (0.001 x 14.6)\nReveal answer"
            },
            {
                "title": "1.3 Rounding",
                "content": "1.3 Rounding\nFor most business and commercial purposes the degree of precision necessary when calculating is quite limited. While engineering can require accuracy to thousandths of a centimetre, for most other purposes tenths will do. When dealing with cash, the minimum legal tender in the UK is one penny, or £00.01, so unless there is a very special reason for doing otherwise, it is sufficient to calculate pounds to the second decimal place only.\nHowever, if we use the calculator to divide £10 by 3, we obtain £3.3333333. Because it is usually only the first two decimal places we are concerned about, we forget the rest and write the result to the nearest penny of £3.33.\nThis is a typical example of rounding, where we only look at the parts of the calculation significant for the purposes in hand.\nConsider the following examples of rounding to two decimal places:\n1.344 rounds to 1.34\n2.546 rounds to 2.55\n3.208 rounds to 3.21\n4.722 rounds to 4.72\n5.5555 rounds to 5.56\n6.9966 rounds to 7.00\n7.7754 rounds to 7.78\nRule of rounding\nIf the digit to round is below 5, round down. If the digit to round is 5 or above, round up.\nActivity 4\nRound the following numbers to two decimal places:\nPart (a)\n(a) 0.5678\nReveal answer\nPart (b)\n(b) 3.9953\nReveal answer\nPart (c)\n(c) 107.356427\nReveal answer\nActivity 5\nRound the same numbers as above to three decimal places:\nPart (a)\n(a) 0.5678\nReveal answer\nPart (b)\n(b) 3.9953\nReveal answer\nPart (c)\n(c) 107.356427\nReveal answer"
            },
            {
                "title": "1.4 Fractions",
                "content": "1.4 Fractions\nSo far we have thought of numbers in terms of their decimal form, e.g., 4.567, but this is not the only way of thinking of, or representing, numbers. A fraction represents a part of something. If you decide to share out something equally between two people, then each receives a half of the total and this is represented by the symbol ½.\nA fraction is just the ratio of two numbers: 1/2, 3/5, 12/8, etc. We get the corresponding decimal form 0.5, 0.6, 1.5 respectively by performing division. The top half of a fraction is called the numerator and the bottom half the denominator, i.e., in 4/16, 4 is the numerator and 16 is the denominator. We divide the numerator (the top figure) by the denominator (the bottom figure) to get the decimal form. If, for instance, you use your calculator to divide 4 by 16 you will get 0.25.\nA fraction can have many different representations. For example, 4/16, 2/8, and 1/4 all represent the same fraction, one quarter or 0.25. It is customary to write a fraction in the lowest possible terms. That is, to reduce the numerator and denominator as far as possible so that, for example, one quarter is shown as 1/4 rather than 2/8 or 4/16.\nIf we have a fraction such as 26/39 we need to recognise that the fraction can be reduced by dividing both the denominator and the numerator by the largest number that goes into both exactly. In 26/39 this number is 13 so (26/13) / (39/13) equates to 2/3.\nWe can perform the basic numerical operations on fractions directly. For example, if we wish to multiply 3/4 by 2/9 then what we are trying to do is to take 3/4 of 2/9, so we form the new fraction: 3/4 x 2/9 = (3 x 2) / (4 x 9) = 6/36 or 1/6 in its simplest form.\nIn general, we multiply two fractions by forming a new fraction where the new numerator is the result of multiplying together the two numerators, and the new denominator is the result of multiplying together the two denominators.\nAddition of fractions is more complicated than multiplication. This can be seen if we try to calculate the sum of 3/5 plus 2/7. The first step is to represent each fraction as the ratio of a pair of numbers with the same denominator. For this example, we multiply the top and bottom of 3/5 by 7, and the top and bottom of 2/7 by 5. The fractions now look like 21/35 and 10/35 and both have the same denominator, which is 35. In this new form we just add the two numerators.\n(3/5) + (2/7) = (21/35) + (10/35)\n= (21 + 10) / 35\n= 31/35\nActivity 6\nPart (a - i)\n(a) Convert the following fractions to decimal form (rounded to three decimal places) by dividing the numerator by the denominator on your calculator:\n(i) 125/1000\nReveal answer\nPart (a - ii)\n(ii) 8/24\nReveal answer\nPart (a - iii)\n(iii) 32/36\nReveal answer\nPart (b - i)\n(b) Perform the following operations between the fractions given:\n(i) 1/2 x 2/3\nReveal answer\nPart (b - ii)\n(ii) 11/34 x 17/19\nReveal answer\nPart (b - iii)\n(iii) 2/5 x 7/11\nReveal answer\nPart (b - iv)\n(iv) 1/2 + 2/3\nReveal answer\nPart (b - v)\n(v) 3/4 x 4/5\nReveal answer"
            },
            {
                "title": "1.5 Ratios",
                "content": "1.5 Ratios\nRatios give exactly the same information as fractions. Accountants make extensive use of ratios in assessing the financial performance of an organisation.\nA supervisor’s time is spent in the ratio of 3:1 (pronounced ‘three to one’) between Departments A and B. (This may also be described as being ‘in the proportion of 3 to 1.’) Her time is therefore divided 3 parts in Department A and 1 part in Department B.\nThere are 4 parts altogether and:\n3/4 time is in Department A\n1/4 time is in Department B\nIf her annual salary is £24,000 then this could be divided between the two departments as follows:\nDepartment A 3/4 x £24,000 = £18,000\nDepartment B 1/4 x £24,000 = £6,000\nActivity 7\nA company has three departments who use the canteen. Running the canteen costs £45,000 per year and these costs need to be shared out among the three departments on the basis of the number of employees in each department.\nTable 1\nDepartment Number of employees\nProduction 125\nAssembly 50\nDistribution 25\nHow much should each department be charged for using the canteen?\nReveal answer"
            },
            {
                "title": "1.6 Percentages",
                "content": "1.6 Percentages\nPercentages also indicate proportions. They can be expressed either as fractions or as decimals:\n45% = 45/100 = 0.45\n7% = 7/100 = 0.07\nTheir unique feature is that they always relate to a denominator of 100. Percentage means simply ‘out of 100’ so 45% is ‘45 out of 100’, 7% is ‘7 out of 100’, etc.\nA company is offered a loan to a maximum of 80% of the value of its premises. If the premises are valued at £120,000 then the company can borrow the following:\n£120,000 x 80% = £120,000 x 0.80 = £96,000\nFractions and decimals can also be converted to percentages. To change a decimal to a percentage you need to multiply by 100:\n0.8 = 80%\n0.75 = 75%\nTo change a percentage to a decimal you need to divide by 100:\n60% = 0.6\n3% = 0.03\nTo convert a fraction to a percentage it is necessary to first change the fraction to a decimal:\n4/5 = 0.8 = 80%\n3/4 = 0.75 = 75%\nIf a machine is sold for £120 plus VAT (Value Added Tax – a sales tax in the UK) at 17.5% then the actual cost to the customer is:\n£120 + (17.5% of 120) = £120 + (0.175 x 120) = £141\nAlternatively, the amount can be calculated as:\n£120 x (100% + 17.5%) = £120 x (1.00 + 0.175) = £120 x 1.175 = £141\nIf the machine were quoted at the price that included VAT (the gross price), and we wanted to calculate the price before VAT, then we would need to divide the amount by (100% + 17.5%) = 117.5% or 1.175. The gross price of £141 divided by 1.175 would thus give the net price of £120. This principle can be applied to any amount which has a percentage added to it.\nFor example, a restaurant bill is a total of £50.40 including a 12% service charge. The bill before the service charge was added would be:\n£50.40 / 1.12 = £45.00\nActivity 8\nPart (a - i)\n(a) Convert the following to percentages\nPart (a - i)\n(i) 0.9\nReveal answer\nPart (a - ii)\n(ii) 1.2\nReveal answer\nPart (a - iii)\n(iii) 1/3\nReveal answer\nPart (a - iv)\n(iv) 0.03\nReveal answer\nPart (a - v)\n(v) 1/10\nReveal answer\nPart (a - vi)\n(vi) 1 1/4\nReveal answer\n(b) A company sells its product for £65 per unit. How much will it sell for if the customer negotiates a 20% discount?\nReveal answer\n(c) If a second product is sold for £65.80 including 17.5% value added tax, what is the net price before tax?\nReveal answer"
            },
            {
                "title": "1.7 Negative numbers and the use of brackets",
                "content": "1.7 Negative numbers and the use of brackets\nNumbers smaller than zero (shown to the left of zero on the number line in the figure below) are called negative numbers. We indicate they are negative by putting them in brackets as shown in the figure below.\nFigure 4\nRules of negative numbers\nThe rules for using negative numbers can be summarised as follows:\nAddition and subtraction\nAdding a negative number is the same as subtracting a positive 50 + (-30) = 50 – 30 = 20\nSubtracting a negative number is the same as adding a positive 50 – (-30) = 50 + 30 = 80\nMultiplication and division\nA positive number multiplied by a negative gives a negative 20 x -4 = -80\nA positive number divided by a negative gives a negative 20 / -4 = -5\nA negative number multiplied by a negative gives a positive -20 x -4 = 80\nA negative number divided by a negative gives a positive -20 / -4 = 5\nTry to confirm the above rules for yourself by carrying out the following exercise either manually or by means of a calculator.\nActivity 9\nCalculate each of the following. (In this activity we will assume the convention that if a number is in brackets it means it is negative).\nPart (a)\n(a) (2) x (3)\nReveal answer\nPart (b)\n(b) 6 – (8)\nReveal answer\nPart (c)\n(c) 6 + (8)\nReveal answer\nPart (d)\n(d) 2 x (3)\nReveal answer\nPart (e)\n(e) (8) / 4\nReveal answer\nPart (f)\n(f) (8) / (4)\nReveal answer\nImportant note\nAlways remember that while a single number in brackets means that it is negative, the rule of BODMAS means that brackets around an ‘operation’ between two numbers, positive or negative, means that this is the first operation that should be done. The answer for a series of operations in an example such as 12 + (-8 – 2).would thus be 2 according to the rules of BODMAS and negative numbers. Note: if 12 + (-8 – 2) was given as 12 + ((8) – 2) the answer would still be 2 as (8) is just another way of showing -8."
            },
            {
                "title": "1.8 The test of reasonableness",
                "content": "1.8 The test of reasonableness\nApplying a test of reasonableness to an answer means making sure the answer makes sense. This is especially important when using a calculator as it is surprisingly easy to press the wrong key.\nAn example of a test of reasonableness is if you use a calculator to add 36 to 44 and arrive at 110 as an answer. You should know immediately that there is a mistake somewhere as two numbers under 50 can never total more than 100.\nWhen using a calculator it is always a good idea to perform a quick estimate of the answer you expect. One way of doing this is to round off numbers. For instance if you are adding 1,873 to 3,982 you could round these numbers to 2,000 and 4,000 so the answer you should expect from your calculator should be in the region of 6,000.\nTest your ability to perform the test of reasonableness by completing the following short multiple choice quiz. Do not calculate the answer, either mentally or by using an electronic calculator, but try to develop a rough estimate for what the answer should be. Then determine from the choices presented to you which makes the most sense, i.e., the choices that are most reasonable.\nActivity 10\nChoose the correct answer purely on what appears to be most reasonable.\nTable 2\n(1) 126 / 7= (2) 17 x 26 = (3) 6,460 / 760 =\na. 180 a. 44.2 a. 850\nb. 0.18 b. 442 b. 0.85\nc. 18 c. 4,420 c. 8.5\nd. 1.8 d. 44,420 d. 85\n(4) 330 x 8.4= (5) 269 + 378= (6) 562 – 268 =\na. 277.2 a. 547 a. 194\nb. 2,772 b. 747 b. 294\nc. 27,772 c. 647 c. 394\nReveal answer"
            },
            {
                "title": "1.9 Table of equivalencies",
                "content": "1.9 Table of equivalencies\nThe next activity in developing your numerical skills required for bookkeeping and accounting is to give you practice in converting between percentages, decimals and fractions. It is a very useful numerical skill to be able to know or to work out quickly the equivalent between a number given in percentage form and in other forms.\nActivity 11\nUse the box below to record your answers for the gaps in the table. The first one is done for you. Answers required in decimals should be rounded off to two decimal points. Answers required in fractions should be written in the lowest possible terms.\nTable 3\nPercentage Decimal Fraction\n1% 0.01 1/100\n2%\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n0.05\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n1/10\n20%\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n0.25\nTo use this interactive functionality a free OU account is required. Sign in or register.\n33 1/3%\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n0.5\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n2/3\n75%\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n1.0\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n2/1\nReveal answer"
            },
            {
                "title": "1.10 Manipulation of equations and formulae",
                "content": "1.10 Manipulation of equations and formulae\nThe final activity in developing your numerical skills is to revise the manipulation of simple equations.\nBeing able to understand and express the Accounting Equation in different forms is crucial to understanding a fundamental accounting concept (the dual aspect concept) and the principal financial statements (the profit and loss account and the balance sheet). You will learn more about the Accounting Equation in sections 2 and 3.\nAn equation is a mathematical expression which shows the relationship between numbers through the use of the equal sign. An example of a simple equation might be 2 + 3 = 5.\nA special type of equation is an algebraic equation where a letter, say ‘x’, represents a number, i.e. in x + 2 = 5, ‘x’ represents 3 in order to make the equation true.\nAlgebraic equations are solved by manipulating the equation so that the letter stands on its own. This is achieved in the equation x + 2 = 5 by the following two steps.\nx = 5 – 2\nx = 3\nThe principal rule of manipulating equations is whatever is done to one side of the equal side must also be done to the other, as was shown above.\nx = 5 – 2 is achieved by subtracting 2 from both sides of the equation x + 2 = 5, i.e.:\nx + 2 – 2 = 5 – 2\nx = 5 – 2\nManipulating an equation to get the algebraic letter to stand on its own involves ‘undoing’ the equation by using the inverse or opposite of the original operation. In the example of x + 2 = 5, the operation of adding 2 must be undone by subtracting 2 from either side of the equal sign.\nThe following table shows a number of examples of how equations are manipulated to obtain the correct number for the algebraic letter.\nTable 5\nOperation Inverse Equation\nadd 7 subtract 7 a + 7 = 9\na + 7 – 7 = 9 – 7\na = 2\nsubtract 5 add 5 b – 5 = 6\nb – 5 + 5 = 6 + 5\nb = 11\nmultiply by 3 divide by 3 (or multiply by 1/3) c x 3 = 18\nc x 3 / 3 = 18 / 3\nc = 6\ndivide by 6 multiply by 6 d / 6 = 2\nd / 6 x 6 = 2 x 6\nd = 12\nAn equation such as a x 3 = 12 can also be expressed as a3 = 12 or 3a = 12, i.e., if an algebraic letter is placed directly next to a number in an equation it means that the letter is to be multiplied by the number.\nThe correct number for the algebraic letter ‘a’ in the equation 3a = 12 will be obtained thus:\n3a = 12\n3a / 3 = 12 / 3\na = 4\nManipulating or rearranging formulae involves the same process as manipulating or rearranging equations.\nImportant note\nA formula is simply an equation that states a fact or rule such as S = D / T or Speed is equal to Distance divided by Time.\nIn the formula S = D / T, S is the subject of the formula. (This simply means that S stands on its own and is determined by the other parts of the formula. By convention the subject is always placed on the left-hand side of the equal sign, although S = D / T means the same as D / T = S)\nAs we learnt to rearrange or manipulate an equation, the formula S = D / T can also be manipulated to make D or T the subject.\nS = D / T\nD / T = S (turning the formula around)\nD = S x T (multiplying both sides of the formula by T)\nOr, from D = S x T\nD / S = T (dividing both sides of the formula by S)\nT = D / S (turning the formula around)\nActivity 12\nSolve the following algebraic equations below.\nPart (i)\n(i) c + 9 = 11\nReveal answer\nPart (ii)\n(ii) a – 15 = 21\nReveal answer\nPart (iii)\n(iii) d x 7 = 63\nReveal answer\nPart (iv)\n(iv) b / 13 = 13\nReveal answer\nActivity 13\nRearrange the formula h = 3dy – r to make:\nPart (i)\n(i) r the subject\nReveal answer\nPart (ii)\n(ii) y the subject\nReveal answer"
            },
            {
                "title": "2 Double entry and the balance sheet",
                "content": "2 Double entry and the balance sheet\nSection learning outcomes\nBy the end of this section you should be able to:\nunderstand and explain the need for financial records and financial statements\nunderstand the business entity and the dual aspect concepts\ndefine assets, liabilities and capital\nunderstand and explain the relationship between the accounting equation and double-entry bookkeeping\nrecord transactions in the appropriate ledger accounts using the double-entry bookkeeping system\nunderstand a simple balance sheet in a vertical format\nbalance off accounts at the end of an accounting period\nprepare a trial balance."
            },
            {
                "title": "2.1 Accounting records and financial statements",
                "content": "2.1 Accounting records and financial statements\nAccounting records store information about all the financial transactions and events of a business. A small business may only have a few financial transactions a day to record while a large, multinational business may have many thousands.\nInformation point\nThis course focuses on business organisations but the core concepts and principles of bookkeeping also apply to non-profit organisations.\nWhy do all businesses need to keep accounting records?\nThey keep track of where money comes from and how it is spent.\nThey are required by law.\nThey help to keep control of goods and property owned by a business.\nThey are used as the basis for financial statements.\nWhat are financial statements?\nFinancial statements are summaries of accounting records that are drawn up to satisfy the information needs of owners and other stakeholders in the business. These stakeholders are presented with the financial records in the form of two main financial summaries or statements. The first of these is a balance sheet which shows the financial state of affairs of a business at a specific date; the second is a profit and loss account which records the income and expenditure of a business for a period of time.\nWho are the typical stakeholders of a business and what information do they need?\nTable 6\nStakeholders Information needs\nOwners Owners, whether they own all or part of a business, want information on the risk and return of their investment in a business.\nManagers Managers need to have reliable financial information on which to base their decisions.\nLenders Lenders and potential lenders need to have information about the ability of the firm to repay loans and to pay interest.\nSuppliers Suppliers, if they give credit to the business, want to know if they will be paid.\nEmployees Employees are particularly interested in the ability of the firm to pay wages and pensions.\nCustomers Customers, especially if they are dependent on a supplier, need to know if the business will continue to exist.\nGovernments and their agencies Reliable financial information from businesses is used as the basis for taxation. In some countries it is also used to compile information about the economy.\nThe public Financial statements often include information relevant to the public interest, such as environmental information or policies on employment of disabled people, etc.\nThe biggest businesses have the most stakeholders. Whatever the size of the business, active and responsible stakeholders will always be interested in how a business, in which they have an informed interest, is financed, and how this finance is used to run the business."
            },
            {
                "title": "2.2 Accounting records and the business entity concept",
                "content": "2.2 Accounting records and the business entity concept\nThe accounting records for even the simplest business must be kept separate from the personal affairs of the owner or owners. This concept that the business stands apart from the owners is known as the business entity concept.\nWhat is the simplest type of business entity?\nThe simplest type of business is known as a sole trader or a sole proprietor. It is a business that is owned and controlled by one person, although the business may employ other people. Sole traders normally adopt a trading name, but the business has no separate legal existence from the owner. As a result, the sole trader (i.e. the owner), although entitled to receive all of the profit or net income of the firm, is also personally liable for the debts of the business. This is referred to as unlimited liability. For bookkeeping and accounting purposes, however, the sole trader will run his or her business as a separate entity following the ‘business entity concept’."
            },
            {
                "title": "2.3 Definitions of assets, capital and liabilities",
                "content": "2.3 Definitions of assets, capital and liabilities\nA business when it starts has no money. The owner puts money in (known as owner’s capital) and perhaps borrows money as well, and this money is used to buy assets that are expected to bring financial benefits for the business in the future. If it were a retail business, these assets might be premises, equipment and goods for resale. A service business might only need an office, furniture and computers.\nThe accounting records separate out the finance put into the company by the owner (owner’s capital) and the finance borrowed (a liability or debt that needs to be repaid). The accounting records also separate out the assets bought from the finance used to buy the assets. The firm can only have as many assets as it has finance available. The accounting records consequently will always reflect that:\nAssets = finance put into the business either from the owner or borrowed\nor\nAssets = capital + liabilities (i.e. finance from the owner/s + finance borrowed)"
            },
            {
                "title": "2.4 A simplified UK balance sheet format",
                "content": "2.4 A simplified UK balance sheet format\nHow do businesses in the UK most commonly present information in the balance sheet?\nIn the UK, balance sheets are commonly prepared in a vertical format of the accounting equation. This gives the owners clear information about the net assets of the enterprise, which always equals their capital or owner ’s interest in the enterprise. The balance sheet is normally produced at the end of each trading or financial year and is a snapshot of the financial position of the business on the last day of the financial year. For learning purposes we will compile a UK balance sheet for Edgar Edwards Enterprises above at the end of its sixth day of trading.\nA simple vertical balance sheet format could look like this:\nTable 9 Edgar Edwards Enterprises Balance Sheet as at 6 July 20X2\nAssets £\nFurniture 400\nComputer 600\nBank (£5,000–£600+£5,000–£200–£50) 9,150\nTotal assets (A) 10,150\nLiabilities\nBank loan 5,000\nCreditors (£400-£200) 200\nTotal liabilities (L) 5,200\nNet assets (A - L)\nTotal\n4,950\nCapital (C)\nTotal\n4,950\nActivity 16\nFill in the missing values in Table 10 in order to prepare a new balance sheet after each of the six transactions by Edgar Edwards Enterprises we have seen in Section 2.3. (The first and last columns have been done for you.). You may find it easier to work on a piece of paper before inputting your answers into the box.\nTable 10\n1 July 20X2 2 July 20X2 3 July 20X2 4 July 20X2 5 July 20X2 6 July 20X2\n£ £ £ £ £ £\nAssets\nFurniture 0\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n400\nComputer 0\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n600\nBank 5,000\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n9,150\nTotal Assets (A) 5,000\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n10,150\nLiabilities\nBank loan 0\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n5,000\nCreditors 0\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n200\nTotal liabilities (L) 0\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\n5,200\nNet Assets (A-L)\nTotal\n5,000\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTotal\n4,950\nCapital (C)\nTotal\n5,000\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTo use this interactive functionality a free OU account is required. Sign in or register.\nTotal\n4,950\nReveal answer"
            },
            {
                "title": "2.5 T-accounts, debits and credits",
                "content": "2.5 T-accounts, debits and credits\nWhat do all accounts look like in a double-entry system?\nTraditional double-entry bookkeeping divides every account into two halves as follows:\nFigure 5\nThis T appearance has led to the convention of ledger accounts being referred to as T-accounts.\nConvention, which has not changed for hundreds of years, prescribes that the left-hand side of a T-account is called the debit side, and the right-hand side is called the credit side.\nFigure 6\nWhat is the main reason that all accounts are divided into a left or debit side and a right or credit side?\nAs we have seen in Sections 2.3 and 2.4, because of the dual aspect of double-entry bookkeeping, if one account changes as a result of a financial transaction, then another account needs to change to keep the accounting equation in balance. This is shown in ledger or T-accounts by recording each transaction twice, once as a debit-entry in one account and once as a credit-entry in another account. This is done according to time-honoured rules which treat asset accounts differently from liability accounts and the capital account.\nWhat are the rules of double-entry bookkeeping?\nIf a transaction increases an asset account, then the value of this increase must be recorded on the debit or left side of the asset account. If, however, a transaction decreases an asset account, then the value of this decrease must be recorded on the credit or right side of the asset account. The converse of these rules applies to liability accounts and the capital account, as shown in the three T-accounts below:\nFigure 7\nPause for thought\nThese rules need to be memorised initially as they are not intuitive. Through seeing how they work in practice and doing exercises they will become second nature – a little bit like learning to swim or ride a bicycle.\nThe balance on an asset account is always a debit balance. The balance on a liability or capital account is always a credit balance. (Later on in this section you will learn how to work out the final or closing balance on an account which has both debit and credit entries. The process of determining the closing balance on an account is known as ‘balancing off ’ an account.)\nThe best way to understand how the rules of double-entry bookkeeping work is to consider an example. We will now record the six transactions carried out by Edgar Edwards Enterprises in the appropriate T-accounts.\nExample\nTransactions:\nThe owner starts the business with £5,000 paid into a business bank account on 1 July 20X2.\nThe business buys furniture for £400 on credit from Pearl Ltd on 2 July 20X2.\nThe business buys a computer with a cheque for £600 on 3 July 20X2.\nThe business borrows £5,000 on loan from a bank on 4 July 20X2. The money is paid into the business bank account.\nThe business pays Pearl Ltd £200 by cheque on 5 July 20X2\nThe owner takes £50 from the bank for personal spending on 6 July 20X2.\nTransaction 1 : The owner starts the business with £5,000 paid into a business bank account on 1 July 20X2. (Following the rules we learnt, we thus need to debit an asset account and credit the capital account.)\nFigure 8\n* Each T-account, when recording a transaction, names the corresponding T-account to show that the transaction reflects a double entry in the nominal ledger.\nTransaction 2 : The business buys furniture for £400 on credit from Pearl Ltd on 2 July 20X2. (We need to debit an asset account and credit a liability account.)\nFigure 9\nTransaction 3 : The business buys a computer with a cheque for £600 on 3 July 20X2. (We need to debit an asset account and credit an asset account.)\nFigure 10\nTransaction 4 : The business borrows £5,000 on loan from a bank on 4 July 20X2. The money is paid into the business bank account. (We need to debit an asset account and credit a liability account.)\nFigure 11\nTransaction 5 : The business pays Pearl Ltd £200 by cheque on 5 July 20X2. (We need to debit a liability account and credit an asset account.)\nFigure 12\nTransaction 6 : The owner takes £50 from the bank for personal spending on 6 July 20X2. (We need to debit the capital account and credit an asset account.)\nFigure 13\nIn Section 2.3 we recorded the consequences of these transactions in a balance sheet for Edgar Edwards Enterprises dated 6/7/20X2. Did you find it easy to do that? As there were only six transactions, it was probably not too difficult. However, many enterprises have to record hundreds of transactions per day. Having individual T-accounts within the nominal ledger makes it much easier to collect the information from many different types of transactions. The next section will explain what is done with the balances in each of these accounts."
            },
            {
                "title": "2.6 Balancing off accounts and preparing a trial balance",
                "content": "2.6 Balancing off accounts and preparing a trial balance\nWhat is a trial balance?\nA trial balance is a list of all the balances in the nominal ledger accounts. It serves as a check to ensure that for every transaction, a debit recorded in one ledger account has been matched with a credit in another. If the double entry has been carried out, the total of the debit balances should always equal the total of the credit balances. Furthermore, a trial balance forms the basis for the preparation of the main financial statements, the balance sheet and the profit and loss account.\nHow do we prepare a trial balance?\nIn order to prepare a trial balance, we first need to complete or ‘balance off ’ the ledger accounts. Then we produce the trial balance by listing each closing balance from the ledger accounts as either a debit or a credit balance. Below are the T-accounts in Edgar Edwards’ nominal ledger. We need to work out the balance on each of these accounts in order to compile the trial balance.\nFigure 14\nWhat is the procedure for balancing off accounts?\nAccounts are straightforward to balance off if they consist of only one type of entry, i.e. only debit entries or only credit entries. In this case, all the account entries are simply added up to get the balance on the account. If, for instance, a bank account has three debit entries of £50 each, then the balance on the account is a debit balance of £150. However, when accounts consist of both debit and credit entries, the following procedure should be used to balance off these accounts:\nAdd up the amounts on each side of the account to find the totals.\nEnter the larger figure as the total for both the debit and credit sides.\nFor the side that does not add up to this total, calculate the figure that makes it add up by deducting the smaller from the larger amount. Enter this figure so that the total adds up, and call it the balance carried down. This is usually abbreviated as Balance c/d.\nEnter the balance brought down (abbreviated as Balance b/d) on the opposite side below the total figure. (The balance brought down is usually dated one day later than the balance carried down as one period has closed and another one has started.)\nUsing the rules above we can now balance off all of Edgar Edwards’ nominal ledger accounts starting with the bank account.\nFigure 15\nWe balance off the capital account in the same way as we did the bank account.\nFigure 16\nThe furniture account has a single entry on one side. This amount is the total as well as the balance in the account.\nFigure 17\nThe account for the creditor, Pearl Ltd, has a debit and a credit entry so we will use the method we used for the bank and the capital accounts.\nFigure 18\nThe computer and bank loan accounts have single entries on one side, like the furniture account, so they need to be treated in the same way.\nFigure 19\nMaking a list of the above balances brought down produces a trial balance as follows.\nTable 12 Edgar Edwards Trial Balance as at 6 July 20X2\ndr cr\n£ £\nBank 9,150\nCapital 4,950\nFurniture 400\nPearl Ltd (a creditor) 200\nComputer 600\nBank loan 5,000\nTotal\nTotal\n10,150\nTotal\n10,150\nInformation point\nFrom the trial balance we can see that the total of debit balances equals the total of credit balances. This demonstrates for every transaction we have followed the basic principle of double-entry bookkeeping – ‘ for every debit there is a credit ’."
            },
            {
                "title": "2.7 Summary",
                "content": "2.7 Summary\nAccounting records are the day-to-day records of all financial transactions and other relevant financial information concerning a business.\nFinancial statements are summaries of accounting records to satisfy the relevant financial information needs of stakeholders of a business.\nThe owner(s) of a business is (are) the main stakeholder(s) in a business but there are a number of other stakeholders.\nIn accounting terms, the business is a separate entity from its owner(s) even if the business is owned by a sole trader with unlimited liability for the debts of the business.\nIn accounting terms, the business is a separate entity from its owner(s) even if the business is owned by a sole trader with unlimited liability for the debts of the business.\nLiabilities are debts owed by the business.\nCapital is the owner’s investment in the enterprise.\nThe vertical balance sheet of a business reflects the accounting equation: Assets – Liabilities = Capital.\nFinancial transactions have two aspects which must be equal to keep the accounting equation in balance.\nFinancial transactions are recorded by debits and credits in the ledger accounts (also known as T-accounts).\nAssets are represented by debit balances while liabilities and capital are represented by credit balances.\nThe following rules apply to asset, liability and capital accounts.\nFigure 20\nTo calculate the balance in an asset account we calculate the excess of debits over credits to get the net debit balance.\nTo calculate the balance in a liability or capital account we calculate the excess of credits over debits to get the net credit balance\nThe balance carried down figure within an asset account is always on the credit side of the account and is brought down as a debit balance.\nThe balance carried down figure within a liability or capital account is always on the debit side of the account and is brought down as a credit balance."
            },
            {
                "title": "3 Double entry and the profit and loss account",
                "content": "3 Double entry and the profit and loss account\nSection learning outcomes\nBy the end of this section you should be able to:\nunderstand the difference between generating cash and making a profit\nunderstand how profit relates to owner's capital in the balance sheet and the accounting equation\nunderstand what the profit and loss account is\nmeasure profit and loss\naccount for closing stock\nstate the double-entry rules for income accounts and expense accounts."
            },
            {
                "title": "3.1 Making a profit and generating cash",
                "content": "3.1 Making a profit and generating cash\nWhat is the main objective of business activity?\nGenerally speaking, the main reason for the existence of a business is to make a profit for the owner(s) over a defined period. (There are, of course, other objectives that a business might have and the business has to work within the laws and customs of society.)\nProfit over a period is achieved by trading successfully, i.e. a business is able to sell goods or services for more than the expenses incurred in producing them in the same period. A loss over a period, on the other hand, is when a business is only able to sell goods or services for less than the expenses incurred in producing them in the same period. If we say that the start of a period is time 0 and the end-date of a period is time 1 then the profit or loss for this length of time can be expressed by the formula:\nProfit or loss 1–0 =Income 1–0 –Expenses 1–0\nInformation point\nIncome is a wider concept than sales as it includes all earnings in a period. Income thus includes interest received, rent received, etc. as well as cash and credit sales.\nWhat is the difference between making a profit and generating cash in an accounting period?\nProfit is when income earned, by cash or credit, is greater than expenses incurred, by cash or credit, in the same accounting period.\nGenerating cash over an accounting period, by contrast, is when cash inflows are greater than cash outflows in the same period. Cash inflows and outflows in a period may be completely unrelated to income and expenses as they may be based, for example, on a financial event that is unrelated to income and expenses, such as the owner introducing capital into the business or drawing capital out of the business.\nWhat is the formula to work out how much cash is generated in a period?\nTo work out how much cash is generated in a period we need to work out the difference between the cash balance at the end of a period (time 1) and the cash balance at the beginning of a period (time 0). This can be expressed in the formula:\nCash generated 1–0 = Cash 1 – Cash 0\nThe next activity should give you an insight into the common situation in business where the profit made in a period is not the same as the cash generated in the same period.\nActivity 17\nAndrew and Barry have recently started exactly the same business – buying and selling music CDs. They each started their trade on 1 January 20X1 with £1,000 entirely borrowed from the bank. Both Andrew and Barry bought their CDs for cash but Andrew decided to allow his customers to buy CDs on credit as he believed this would generate more sales.\nIn the first week of trading Andrew bought CDs for £800, all cash, and sold them all for £1,600 – all on credit. Barry, on the other hand, bought CDs for £400, all cash, and sold them all for £800 cash.\nRequired\nPart (a)\n(a) Assuming that Andrew and Barry had no other income and expenses in the week, use the formula Profit 1–0 = Income 1–0 – Expenses 1–0 to calculate each of their profit for the week.\nReveal answer\nPart (b)\n(b) Assuming that Andrew and Barry had no other transactions in the week, use the formula Cash generated 1–0 = Cash 1 – Cash 0 to calculate each of their cash generated for the week.\nReveal answer\nPart (c)\n(c) What do your answers to (a) and (b) tell you about the effect of credit sales on profit earned and cash generated in a business?\nReveal answer\nFrom the activity above we have seen that it is possible for a business to make a profit in a period but lose cash in the same period. The reason for this is that the different transactions in the activity above had different effects on profit earned and cash generated in the same period. The next activity should help you to better understand this.\nActivity 18\nUse the box below to complete answers for Table 13. Indicate the effect (either none, increase or decrease) on profit and/or cash of the following eight transactions. The first four transactions relate to the transactions completed in Activity 17 while the last four transactions refer to likely further transactions of the businesses in Activity 17.\nTable 13\nEffect on profit Effect on cash\n1. Receipt of a loan\n2. Buying stock for cash\n3. Making a cash sale\n4. Making a credit sale\n5. Receiving cash from a debtor\n6. Buying stock on credit\n7. Payment for stock bought on credit\n8. Repayment of a loan\nTo use this interactive functionality a free OU account is required. Sign in or register.\nHow does making a profit in a business relate to the capital of a business?\nWe have already learnt that the capital of a business is the value of the investment in the business by the owner(s). If the business makes a profit then the value of the investment by the owner (or capital) increases. The best way to understand how this works is to look at the effect of profit on the accounting equation."
            },
            {
                "title": "3.2 The effect of profit on the accounting equation",
                "content": "3.2 The effect of profit on the accounting equation\nIn Section 2 we looked at the three elements of the accounting equation – assets, liabilities and capital – and how these three elements are presented in the balance sheet. However, a business’s trading activities, i.e. its income and expenses incurred in order to generate profit, are not shown in the balance sheet.\nBelow is an abridged balance sheet of a firm at the beginning of a financial period and before any trading has taken place.\nTable 15 Peter’s Photographic Enterprises Balance Sheet as at 1 January 20X1\nAssets £\nPremises and equipment 40,000\nStock\nTotal\n6,000\nTotal assets (A) 46,000\nLiabilities\nCreditors\nTotal\n19,000\nTotal liabilities (L)\nTotal\n19,000\nNet assets (A – L)\nTotal\n27,000\nCapital (C)\nTotal\n27,000\nIncluded in the firm’s stock account at the beginning of the year are seven cameras that cost £100 each. On the second day of the year, the business sells one of these cameras for £175 cash. The firm will thus have gained £75 on this transaction.\nHow is this profit-making sale reflected in the accounting equation?\nIf we analyse the transaction, Peter’s Photographic Enterprises (PPE) has received £175 cash from the customer, so that means net assets are increased by £175.\n(Net assets of £27,000 + £175 = £27,175)\nAt the same time, an asset has disappeared. The stock will be down by one camera, and so that must be reflected in the accounts.\n(Net assets of £27,000 + £175 cash – £100 stock reduction = £27,075)\nIf you remember, we established that the main objective of the business was to generate profit for the owners. That is what has happened here, the business has gained an asset of £175 against giving up a camera that cost £100. In other words, the transaction has resulted in an income of £175 and an expense of £100. The transaction has thus created a profit of £75 (£175 – £100) for the owners assuming there are no other expenses.\n(Net assets of £27,075 = Owner ’s capital of £27,000 + £75 profit or increase in owner ’s capital)\nThe accounting equation thus balances, but the business has other expenses that need to be taken into account. Suppose PPE buys advertising for £30 cash. This will reduce the profit created by £30 as well as reducing cash.\n(Net assets of £27,075 – £30 (decrease in cash) = Owner’s capital of £27,075 – £30 (decrease in capital))\nWhat would be the effect on the balance sheet of the two transactions above?\nAfter this a new balance sheet can be drawn up showing net assets of £27,045 and capital of £27,045. The business has made a profit or financial gain of £45 since the previous balance sheet. The balance sheet, however, does not give a breakdown of profit into income and expenses and for that we need the profit and loss account that will be discussed in more detail in the next section.\nWhat is the new accounting equation once Income (I) and Expenses (E) are included?\nThe net figure of income less expenses is calculated at the end of the financial period in the profit and loss account. This net figure, either a profit or a loss, is then transferred to the capital account. The accounting equation can be extended to show this change to capital: A – L = C + (I – E).\nInformation point\nYou should realise from the equation A – L = C + (I – E) that if a business makes a profit in a financial period (i.e. I > E) then capital (C) will have increased for the business over the financial period. If a business has made a loss in a financial period (i.e. I < E) then capital (C) will have decreased over the same period. Always remember that capital (or the owner’s interest) increases with profits and decreases with losses."
            },
            {
                "title": "3.3 The profit and loss account",
                "content": "3.3 The profit and loss account\nThe profit and loss account is a financial statement which sets out the results of the trading activities of an enterprise in a detailed breakdown of income generated and expenses incurred. Different businesses have different breakdowns of income and expenses and hence present financial information in the profit and loss account in different formats. However, the overall or net profit recorded in the profit and loss account for any business is also the amount by which the balance sheet value of the business has increased.\nWhat are the formats of the profit and loss account?\nThe format of the profit and loss account (P&L account) will vary depending on whether the business is a manufacturing concern (i.e. making goods they sell) or a non-manufacturing concern (i.e. either buying goods for resale or selling a service for a fee).\nInformation point\nWhatever the nature of the business, each type of income or expense has its own account in the nominal ledger like the balance sheet items we looked at in Section 1.\nWhat is the difference between net profit and the other important form of profit?\nThe most important profit for a business is the net or overall profit. It is the increase in the financial value or worth of a business after all expenses have been deducted from income. The second most important form of profit is the gross profit. This is the difference between sales and the cost of the goods or stock sold, known as the cost of sales. Gross profit is thus the profit earned by a business before the overheads or general expenses of running the business such as advertising, rent, salaries, and heating and lighting are deducted. The difference between gross profit and net profit will become clearer to you as we look at a number of examples in this section."
            },
            {
                "title": "3.4 Income and expense accounts",
                "content": "3.4 Income and expense accounts\nA successful business will have many transactions and, rather than take the profit or loss to owner’s capital on each transaction, similar income or expenses are collected together in separate accounts in the nominal ledger. These accounts are totalled at the end of a time period (at least once a year but probably each month as well) to measure the total profit or loss for that period. The P&L account, when published as a financial statement, is a summary of all the income and expense accounts that reflect the year’s trading transactions.\nAs with assets and liability items, items of income and expense are recorded in nominal ledger accounts according to set rules. Expenses are always recorded as debit entries in expense accounts and income items are always recorded as credit entries in income accounts.\nWe will now look at Peter’s Photographic Enterprises’ initial transactions as they would be dealt with in the nominal ledger.\nFigure 21\nWe could prepare a P&L account from those T-accounts that we indicated were either income accounts or expense accounts.\nTable 16 Peter’s Photographic Enterprises Profit and loss account\n£\nSales (Income account) 175\nCost of sales (Expense account)\nTotal\n100\nGross profit 75\nExpenses\nAdvertising (Expense account)\nTotal\n30\nNet profit for the period\nTotal\n45\nThe effect on the balance sheet would be:\nAssets\nIncrease in cash +£145 (the increase in the cash T-account)\nDecrease in stock –£100 (the decrease in the stock T-account)\nLiabilities\nNo change\nChange in net assets +£45\nCapital\nProfit +£45\nInformation point\nIn the example above the net profit of £45 is not the same as the increase in cash of £145. As we learned in Section 3.1, net profit is often very different from the increase or decrease in cash in the same period.\nActivity 19\nA business carries out the following cash transactions:\na.business buys stock of bicycles for £1,000\nb.customer pays £300 for one bicycle (cost of bicycle is £200)\nc.business pays £45 for electricity.\nEnter these on the T-accounts below, and draw up a P&L account.\nFigure 22\nReveal answer"
            },
            {
                "title": "3.5 Accounting for closing stock",
                "content": "3.5 Accounting for closing stock\nThe bookkeeping for stock transactions can be done in a number of different ways.\nIn an ideal world, the bookkeeping entries would follow the physical flow of the goods:\naccumulate purchased supplies in a stock account – an asset account in the nominal ledger\nwhen an item is sold, transfer it to a cost of sales account – an expense account in the nominal ledger\nat the end of the period, transfer the balance in the cost of sales account to the P&L account in order to work out the gross profit.\nThis is how we did it in the example above of Peter ’s Photographic Enterprises’ sale of a camera. In practice, however, this method is inefficient in a context where there are many transactions and they each have a low unit value. For example, if you were running a grocery store, you would not want to carry out a bookkeeping transaction to transfer each item sold from stock to expense.\nFrom here on we will therefore use a simplified procedure that assumes that as the business buys goods for resale, they are immediately treated as an expense, called purchases, in the ledger. Then, at the end of the accounting period, the value of the closing stock (i.e. stock remaining at the end of the period) is deducted from purchases to show as cost of sales only the value of stock or goods sold in the period.\nInformation point\nThis section deals only with closing stock, the stock that is normally determined at the stocktake on the last day of the accounting period.\nWhat would be the T-account entries for a business which, in the course of the financial year ended 31/12/20X7, bought goods for cash to the value of £2,180 and had a closing stock of £220 on the last day of the financial year?\nFigure 24\nInformation point\nUnlike the stock account, the cash account has not been ‘balanced off’. This is because cash purchases (i.e. £2,180) were not all of the cash transactions for the business during the year. In the real world, cash and stock are both assets of a business and they need to be ‘balanced off’ at the end of the period.\nThe P&L account now shows cost of sales, the value of stock used up in the period, i.e. £2,180 (Purchases) – £220 (Closing stock) = £1,960.\nAll accounts are ruled off at the period end to show the end-of-period balances that are transferred to the trial balance. Liability and asset accounts (like the stock account above) are said to be ‘balanced off ’. This involves bringing the balance forward to the next accounting period. On the other hand, income and expense accounts (like the purchases account above) are ‘closed off ’ because no balance is brought forward to the next accounting period. The balance in every income and expense account is brought to zero at the period end by a double entry to the P&L account.\nIn the example above, what was the double entry to ‘close off’ the purchases account?\nThe purchases account was ‘closed off ’ for the year by crediting the purchases account by £2,180 and debiting the profit and loss account by the same amount.\nInformation point\nYou should have noticed from the example above that the P&L account is not only a financial statement like the balance sheet, but is also the name of a nominal ledger account. In general, when we refer to a P&L account we are referring to its meaning as a financial statement and not as an account in the nominal ledger.\nThe following activity shows how we complete the P&L account, in its conventional form as a financial statement, from closing balances in income and expense accounts.\nActivity 20\nA small business, with no opening stock, has the following closing balances in its income and expense accounts for the financial year just ended on 31 December 20X5:\nSales £21,568\nPurchases £10,261\nRent £4,568\nHeating and lighting £756\nInsurance £329\nOffice expenses £287\nAt the last day of the year a stocktake was carried out and the stock figure for the year was £987.\nUsing the template for the P&L account given below, ‘close off’ or transfer the balances above to the P&L account and work out the net profit for the year.\nFigure 25\n*In the format of the P&L account as a financial statement, the two columns do not represent debits and credits. The purpose of the first column is to give sub-totals, when required, for the totals that make up the second column.\nReveal answer\nIncome and expense accounts, like asset and liability accounts, reflect the accounting equation and the rules of double-entry bookkeeping, as will be shown in the next section."
            },
            {
                "title": "3.6 The accounting equation and the double-entry rules for income and expenses",
                "content": "3.6 The accounting equation and the double-entry rules for income and expenses\nAs we saw in Section 3.2, the accounting equation, extended to include income and expenses, can be expressed as follows:\nA – L= C+ (I – E)\nThis equation can be rearranged as A+ E =C+ L+ I according to the rules of mathematics.\nThe next activity should help you to understand the importance of both forms of the accounting equation.\nActivity 21\nA business has assets of £110,000, liabilities of £30,000, income in the year of £20,000 against expenses incurred of £10,000 and capital at the beginning of the year of £70,000. Using the two forms of the accounting equation, insert these figures into each equation to show that the equation holds true in both cases.\nReveal answer\nWhat is the point of knowing the second form of the accounting equation?\nThis second form of the equation, i.e. A + E =C + L + I, is very useful to remember as it gives you all the rules of double-entry bookkeeping, including the ones for income and expense accounts.\nAssets (A) and expenses (E) are on the left side of the equation representing debit balances. The double-entry rule is thus: if a transaction increases an asset or expense account, then the value of this increase must be recorded on the debit or left side of these accounts.\nLikewise in the equation, capital (C), liabilities (L) and income (I) are on the right side of the equation representing credit balances. The double-entry rule is thus: if a transaction increases a capital, liability or income account, then the value of this increase must be recorded on the credit or right side of these accounts.\nThe following T-accounts may help you to learn these ‘golden rules’ of double-entry bookkeeping.\nFigure 27\nIn the final activity of this section, you will need to apply your knowledge of the double-entry rules, the P&L account, the balance sheet and the accounting equation.\nActivity 22\nJane Michaela, trading as Michaela Enterprises, has the following closing balances in ledger accounts for her first year in business, the financial year just ended on 31 December 20X7:\nOpening capital £5,000\nCash and bank £2,853\nFurniture £3,200\nComputers and equipment £2,010\nDebtors £790\nCreditors £1,100\nBank loan £2,000\nSales £33,230\nPurchases £21,565\nRent £6,053\nHeating and lighting £1,256\nInsurance £988\nOffice expenses £2,615\nUsing the template below, complete the trial balance for the year.\nUsing the formula I – E (Income – Expenses), calculate the net profit for the year ended 31/12/20X7 if the closing stock was £200.\nUsing the formula C+ (I – E) (Capital + (Income – Expenses)), calculate the capital as at 31/12/20X7.\nUsing the formula A – L (Assets – Liabilities), calculate the net assets as at 31/12/20X7.\nWhat do you notice about your answers to 3 and 4?\nFigure 28\nReveal answer\nInformation point\nClosing stock is not included in the trial balance as it does not reflect a transaction that has a dual aspect – it is merely the purchases that have not been sold in the year. If there is any opening stock it is included in the trial balance at the year end."
            },
            {
                "title": "3.7 Post trial balance nominal ledger accounts",
                "content": "3.7 Post trial balance nominal ledger accounts\nIn Activity 22, the trial balance of Michaela Enterprises as at 31/12/20X7 did not include the effect of the closing stock on the nominal ledger accounts. As shown in the answer to Activity 22, once the closing stock is known then the profit or loss for the period can be determined and the relevant ledger accounts can be finalised. The following activity should remind you how to complete the account for closing stock in the nominal ledger. Activity 23 will also show how the P&L account in the nominal ledger is ‘closed off ’ to the capital account at the end of the period.\nActivity 23\nInsert the missing entries of closing stock of £200 and profit for the period of £953 in the stock, P&L and capital accounts for Michaela Enterprises for the year ended 31 December 20X7.\nFigure 30\nReveal answer"
            },
            {
                "title": "3.8 Summary",
                "content": "3.8 Summary\nProfit = Income – Expenses (P = I – E).\nGross profit = Sales – Cost of sales.\nNet profit = Sales – Cost of sales – Other expenses.\nIn this course, goods bought for sale are initially treated as an expense (purchases) in the accounts.\nGoods bought for sale that are unsold at the period end are an asset called stock and are carried forward to the next accounting period.\nClosing stock at the period end must be deducted from purchases in order for the cost of sales for the period to be worked out.\nThe balance sheet at the end of a period reflects the following expanded accounting equation:\nCapital + (Income – Expenses) =Assets – Liabilities\nThe accounting equation can also be represented as:\nAssets + Expenses = Capital + Liabilities + Income\nCapital + Liability + Income accounts are increased via credit entries and decreased via debit entries.\nThe trial balance (TB) records all the credit or debit balances from the accounts.\nThe P&L account and the balance sheet can be produced from the TB."
            },
            {
                "title": "Conclusion",
                "content": "Conclusion\nThis free course Introduction to bookkeeping and accounting has covered the skills and knowledge required to understand double-entry bookkeeping, the trial balance and the two principal financial statements: the balance sheet and the profit and loss account. Perhaps the most important aspect of accounting that you learnt is the knowledge that for all organisations and individuals their financial position or worth can be in expressed in the accounting equation i.e. Assets (A) – Liabilities (L) = Capital (C). By extending this simple equation to include income (I) and expenses (E) the accounting equation can also be expressed as A – L = C + (I –E).\nThis OpenLearn course provides a sample of level 1 study in Business & Management\n.\nYou might be interested in a more recent Open University course: B124 Fundamentals of accounting.\nBookkeeping with the NEC\nAccelerate your career with the ICB Level 2 Certificate in Bookkeeping online course with the National Extension College (NEC).\nNEC's ICB Level 2 Certificate in Bookkeeping online course covers all the core elements of bookkeeping, ensuring you have the knowledge you need to keep on top of your business finances, to boost your skills for your job or become self-employed as a bookkeeper. You’ll cover all the key elements, including double-entry book-keeping, VAT, ledgers, wages and salaries, and balance sheets in a way that is engaging and easy to understand. This course offers flexible online learning with course materials developed by subject experts and tutor-marked assignments.\nEnrol from £395, plus ICB membership fee.\nFind out more about Bookkeeping here. "
            },
            {
                "title": "Next steps",
                "content": "Next steps\nNow that you’ve completed this free OpenLearn course, Introduction to bookkeeping and accounting, why not take a look at our other free courses in money and business\n? If this has inspired you to continue your study further, check out what’s on offer in business and management at The Open University.\nGet careers guidance\nThe National Careers Service  can help you decide your next steps with your new skills."
            },
            {
                "title": "Acknowledgements",
                "content": "Acknowledgements\nThis free course was written by The Open University.\nExcept for third party materials and otherwise stated (see terms and conditions\n), this content is made available under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 Licence  .\nThe material acknowledged below is Proprietary and used under licence (not subject to Creative Commons Licence). Grateful acknowledgement is made to the following sources for permission to reproduce material in this course:\nCourse image Jason Rogers  in Flickr made available under Creative Commons Attribution 2.0 Licence .\nEvery effort has been made to contact copyright owners. If any have been inadvertently overlooked, the publishers will be pleased to make the necessary arrangements at the first opportunity.\nDon't miss out\nIf reading this text has inspired you to learn more, you may be interested in joining the millions of people who discover our free learning resources and qualifications by visiting The Open University – www.open.edu/ openlearn/ free-courses.\nThis free course is adapted from a former Open University course called ' Introduction to bookkeeping and accounting (B190) '."
            }
        ],
        "url": "https://www.open.edu/openlearn/money-business/introduction-bookkeeping-and-accounting/content-section-0?active-tab=description-tab"
    },
    {
        "title": "Supporting adult learners’ positive mental health",
        "description": "Education & Development",
        "category": "Education & Development",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/education-development/supporting-adult-learners-positive-mental-health/content-section-overview?active-tab=description-tab"
    },
    {
        "title": "Exploring learning disabilities: supporting belonging",
        "description": "Health, Sports & Psychology",
        "category": "Health, Sports & Psychology",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/health-sports-psychology/exploring-learning-disabilities-supporting-belonging/content-section-overview?active-tab=description-tab"
    },
    {
        "title": "Getting started on classical Latin",
        "description": "History & The Arts",
        "category": "History & The Arts",
        "chapters": [
            {
                "title": "Introduction",
                "content": "Getting started on classical Latin\nIntroduction\nThe aim of this free course is to enable you to get started on learning Latin in a fairly leisurely but well-focused way. It has been developed in response to requests from students who had had no contact with Latin before and who felt they would like to spend a little time preparing for the kind of learning that studying a classical language involves. This course will give you a taster of what is involved in the very early stages of learning Latin. Along the way, you will learn some Latin words, master the pronunciation of Latin and explore the links between Latin and English. Importantly, too, you will gain a basic understanding of how Latin ‘works’ – its grammar and sentence structure – and gain a useful impression of what learning Latin actually involves. The material which follows is designed to be studied in small sections. In all, it will probably take about 8–10 hours to work through. But even if you have only a small amount of time available, you will find it useful to work through the early sections and familiarise yourself with some basic grammatical terms.\nThis OpenLearn course is an adapted extract from the Open University course A276 Classical Latin: the language of ancient Rome\n."
            },
            {
                "title": "Learning outcomes",
                "content": "Learning outcomes\nAfter studying this course, you should be able to:\nunderstand some of the main links between English and Latin\npronounce Latin words confidently\nhave an understanding of basic English grammar in order to recognise and describe the way languages work\nunravel basic Latin sentences."
            },
            {
                "title": "1 Learning Latin study techniques",
                "content": "1 Learning Latin: study techniques\nIf you have studied classical literature in translation, at the OU or elsewhere, you will be used to the demands of extensive reading of set books, note-taking and preparing essays. However, the ‘tools of the trade’ for learning a classical language are somewhat different, and you will need to develop new skills, of which the most basic are actually the most important, since they underpin everything else that you do as you progress your studies in the area.\nTo study Latin successfully, students typically find they need to develop a study pattern suited to their lifestyle and to the demands of this type of language learning. ‘Little and often’ is best; however, you may not be able to set aside an hour or so each day. This course will give you the opportunity to try out various study patterns and find out which suits you best.\nYou will also be able to find out which aspects of language learning come easily to you, and which seem more difficult or more time-consuming. For example, some people find dealing with grammar difficult. Others may worry about memorising words, although with practice many people find that they can develop techniques to help with this. As you work through this material, you might like to experiment with different ways of learning vocabulary – for example, writing out the Latin words and/or saying them aloud; thinking of English words which are derived from, and therefore similar to, the Latin words you have learnt; using flash cards; getting a friend to test you; recording vocabulary items and listening back to them; or a combination of these strategies. If you can set up the habit of learning just a few words each day, you will benefit enormously."
            },
            {
                "title": "2 Links between English and Latin",
                "content": "2 Links between English and Latin\nAlthough Latin is not the direct ancestor of the English language, as it is of languages such as Italian, French and Spanish (the so-called ‘Romance’ languages), it has nevertheless given us an enormous number of English words. According to some estimates, around half of all English words come from Latin."
            },
            {
                "title": "2.1 Latin and English: the Roman empire",
                "content": "2.1 Latin and English: the Roman empire\nYou may be familiar with the idea that words such as science, transport and solution are derived from Latin, but did you know that street and kipper come from Latin words which entered ordinary speech during the period from the first to the early fifth centuries AD, when Celtic Britain was part of the Roman empire?\nActivity 1\nThere are other homely words in this category. Try matching the following English words with their Latin origins below.\nSkip to accessible version of matching question\nbeer\ncaster/cester/chester (as in Lancaster, Gloucester, Chester)\nwall\nsack\nstreet\ncheese\nsock\nbox\nwine\ncandle\npeas\nbibere (= to drink)\nbuxus (= boxwood)\ncandela\nvinum\ncaseus\npisum\nsaccus (= large bag)\nsoccus (= slipper)\nstrata (via) (= paved way)\nvallum (= palisaded earthwork)\ncastra (= camp, fort)\nDrag each answer (above) into the correct slot (below)."
            },
            {
                "title": "2.2 The influence of Norman French",
                "content": "2.2 The influence of Norman French\nIn the sixth century, the Latin of the Christian church added such words as monastery and minster, pope and noon (from nona hora = ninth hour = 3pm) to the language, which was then essentially Anglo-Saxon. When William the Conqueror and his Normans came to Britain in the eleventh century, a vast number of words, derived both from Norman French and from written Latin, entered English. Among these are duke, general, soldier, army, palace, law, chivalry, merchant, mutton, beef and pork. In some instances, English was further enriched by having two versions of what was originally a single Latin word.\nTable 1 English words derived from Latin and from Latin through French\nWords from Latin through French Words from Latin\ntreason tradition\nrage rabies\nray radius\npoor pauper\nreason ration, ratio\nfirm secure\nabridge abbreviate"
            },
            {
                "title": "2.3 The Renaissance to the modern era",
                "content": "2.3 The Renaissance to the modern era\nThe Renaissance in Europe, the Enlightenment in Britain, and the growth of science and technology in the nineteenth and twentieth centuries, produced thousands more words derived from Latin, such as administration, computer, decimal, horticulture, interface, molecule, missile, satellite and superhuman.\nThis is a huge and fascinating topic. If you would like to think about it in greater depth, you could read Latin in our Language by Peter Barker − see the ‘ Further reading ’ section for full publication details. This book contains many vocabulary exercises.\nIn English there are often two words expressing the same idea, one of Anglo-Saxon origin, the other of Latin origin. Anglo-Saxon words can often seem more simple and straightforward in style, while Latinate words can seem more scientific and academic. So simple words and phrases such as go down, high, sad, speed up, watch, hate, do well and hide, for example, can be contrasted with words of Latin origin like descend, elevated, miserable, accelerate, observe, detest, succeed and conceal. But do bear in mind that not all words derived from Latin sound elevated: remember the homely words of Latin origin you met in Section 2, like cheese, peas and sock !\nActivity 2\nIn addition to the words which have derived from Latin or from Latin through French, English also uses a number of words taken straight from Latin without any change. See if you can match the following Latin/English words with the meanings of the original Latin words below.\nSkip to accessible version of matching question\nvacuum\nagenda\ndata\nexit\ninnuendo\nreferendum\nformula\nlens\nplus\nfungus\nmedia\nthings to be discussed\nthings given\nhe/she goes out\nrule/method\nmushroom\nby hinting\nlentil\nthings in the middle\nmore\nthing to be referred\nempty thing\nDrag each answer (above) into the correct slot (below)."
            },
            {
                "title": "2.4 Latin vocabulary",
                "content": "2.4 Latin vocabulary\nThe links between Latin and English vocabulary are good news for students of Latin. Because of the presence of so many words of Latin origin in English, many Latin words are relatively easy for English speakers to absorb. Indeed, some Latin words are almost identical to their English equivalents, as shown in Table 2.\nTable 2 Latin words with similar English equivalents\nLatin word English meaning\nadulescens young man, youth, adolescent\naffirmo I affirm\ndesidero I desire\nfinis finish, end\npars part\npersuadeo I persuade\nrapidus rapid, swift\nrespondeo I reply, respond\nsimilis similar, like\ntemplum temple\nThe fact that Latin words often have English derivatives can also make them relatively straightforward to learn.\nTable 3 Latin words with English derivatives\nLatin word English derivations\nfamilia, household family\nfilius, son filial\nhabito, I live, dwell habitat\ncelo, I hide conceal\nclamo, I shout exclaim\nintro, I enter enter\nporto, I carry porter\ntimeo, I fear timid\nvoco, I call vocation (i.e. a 'calling')\namo, I love amiable\ncuro, I look after curator\nActivity 3\nNow it’s time to do a little vocabulary building. How many of the following common Latin words can you guess the meaning of? Type your answers next to the Latin words in the box provided.\nTo use this interactive functionality a free OU account is required. Sign in or register."
            },
            {
                "title": "3 The pronunciation of Latin",
                "content": "3 The pronunciation of Latin\nContrary to what many people think, we do know how classical Latin (the Latin spoken in the first century bcE and the first century CE) was pronounced. One of the main clues is provided by the spelling of Latin names in Greek: thus, since the Latin name Valeria, for instance, was spelled Oualeria in Greek, we can tell that Latin ‘v’ was pronounced as a ‘w’ sound. Alternative spellings and misspellings on inscriptions also help to show common pronunciations, as do the regular metres of Latin poetry; the remarks of ancient grammarians and other writers; and comparison of Latin with other languages."
            },
            {
                "title": "3.1 Latin pronunciation and the Latin alphabet",
                "content": "3.1 Latin pronunciation and the Latin alphabet\nThe Roman alphabet is still very much in use today: it is the alphabet used for English and many other languages throughout the world, and it owed its original spread to the use of Latin in the western Roman empire. In classical times, the alphabet consisted of 23 letters, not our 26, as it lacked j, v and w."
            },
            {
                "title": "3.2 Learning to pronounce Latin",
                "content": "3.2 Learning to pronounce Latin\nMost students find that they master the principles of pronouncing Latin easily enough, though it can take a little patience and practice. Unlike with modern languages, there is no pressure to develop an ‘authentic’ Latin accent. However, being able to pronounce Latin consistently will ultimately allow you to absorb Latin vocabulary more quickly, read more fluently and appreciate the rhythms and sounds of Latin poetry and prose that much better.\nActivity 4\nTo learn how Latin is pronounced, visit the ‘Sounds’ section of the Introducing Classical Latin\nwebsite, produced by The Open University. You should set aside around an hour to work through this section of the site. (If you have studied some Latin before, you may find browsing this section of the website a useful way of refreshing your memory.)\nTo begin to acquire some basic Latin vocabulary, you may also like to look at the ‘Words’ section of the Introducing Classical Latin site. (But note that you will be prompted to revisit the site later, both to look at the ‘Words’ section again – and also to work through the ‘Sentences’ section, which you should leave to one side for now.)\nIn line with the ‘little and often’ approach that you are advised to adopt for learning Latin, you may wish to break down your time working on the ‘Sounds’ and ‘Words’ sections into small chunks of 10–20 minutes. You will no doubt also find it useful to revisit the Introducing Classical Latin website again after a few days, too, to review what you have learnt: consolidation and practice are key when it comes to making languages stick!\nYou will notice that, some letters on the Introducing Classical Latin site are marked with short lines over the top; these are called ‘macra’ (singular: macron) and they mark the difference between ‘short’ and ‘long’ vowels. (You can hear the difference between the length of vowels when you work through the section on the ‘Sounds’ of the Latin alphabet.) Macra can be useful when learning how to pronounce Latin words, but since most printed versions of Latin texts do not use them, we’ve chosen not to include them in this OpenLearn course."
            },
            {
                "title": "4 Introducing grammar",
                "content": "4 Introducing grammar\nThe grammar of a language is simply a way of describing the rules its native speakers intuitively use when they speak or write. In this section, you will explore some aspects of English grammar that it will be useful for you to be aware of when studying Latin. As someone who has already mastered one complex language that is related to Latin – namely English – you may be pleasantly surprised at how familiar some of the principles of Latin grammar turn out to be."
            },
            {
                "title": "4.1 Inflection",
                "content": "4.1 Inflection\nThe underlying grammatical rules of Indo-European languages (for example, English, Gaelic, French, German, Russian, Latin, Greek, Punjabi) are similar, but it is not always easy to appreciate this when you are beginning to learn a new language. A common feature of all these languages is the ‘inflection’ of nouns, adjectives and verbs, whereby the end of the word is changed according to its function in the sentence. For example, woman, woman’s, women and women’s are all inflections of a noun. This and these are inflections of an adjective, and teach, teaches, teaching and taught are inflections of a verb.\nModern English uses inflected forms in a fairly limited way. But many languages use them much more than English does – including Latin which is a heavily inflected language. In English, we have, on the whole, exchanged the inflections for a very strict system of word order. For example, ‘Those girls are feeding the horses’ means one thing and ‘The horses are feeding those girls’ means something rather different. Similarly, ‘You are going to Spain tomorrow’ is different from ‘Are you going to Spain tomorrow?’ We can tell who is doing what to whom, in the first example, and whether something is a statement or a question, in the second example, from the order of the words.\nThis is much less true of Latin. The endings of words (the inflections) are vital to understanding how words relate to each other and enable us to work out the meaning of a sentence. When learning Latin (or Greek, German or Russian), we have to change our reading habits. We need to look even more carefully at the ends of words than at the beginnings, and only if we do this will the meaning of a sentence become clear and unambiguous. In learning Latin, vocabulary is important, but just as important is the system of word endings."
            },
            {
                "title": "4.2 Parts of speech",
                "content": "4.2 Parts of speech\nIn describing the grammar of written Latin, the best method is to use the traditional classical grammar, as worked out by the Greeks and Romans themselves. As a preliminary exercise, it may be useful to be familiar with the ‘parts of speech’ in English.\nTable 4 below gives a very brief explanation of the eight parts of speech which are found in both Latin and English. A fuller discussion of the most important terms follows.\nTable 4 Parts of speech in English\nPart of speech Explanation Latin derivation of the term\nnoun a naming word nomen, a name\npronoun a word used in place of a noun pro, instead of; nomen, a name\nadjective a 'describing' word adiectum, thrown at, added\nverb a 'doing' or 'being' word verbum, a word\nadverb a word added to a verb, adjective or another adverb ad, to; verbum, a word\npreposition a word placed before a noun or pronoun prae, in front of; positum, placed\nconjunction a joining word coniunctum, joined\ninterjection an exclamation interiectum, thrown between, insert"
            },
            {
                "title": "4.3 Sentences",
                "content": "4.3 Sentences\nIn this section, you will take a closer look at sentences, in particular the concepts of ‘subject’ and ‘object’ which are so vital for understanding Latin."
            },
            {
                "title": "4.4 Unravelling sentences",
                "content": "4.4 Unravelling sentences\nIn this section you get to practise your skills of analysing English sentences, first by looking at a passage of prose then at poetry."
            },
            {
                "title": "5 Reading Latin working with words and sentences",
                "content": "5 Reading Latin: working with words and sentences\nTo round off your work on sentences, you should now revisit The Open University’s Introducing Classical Latin\nwebsite. In Section 3.2, you were asked to work through the ‘Sounds’ section and, if you had time, to begin looking through the ‘Words’ section.\nActivity 13\nNow finish working through the ‘ Words ’ section of the Introducing Classical Latin site. Once you are confident that you have a reasonable grasp of the 24 Latin words you are asked to learn, work through the ‘ Sentences ’ section, looking at ‘Using Nouns 1', ‘Using Nouns 2’ and ‘Using Adjectives’ . The activities on this website will give you the opportunity to translate some basic Latin sentences. As you work through the exercises, you will also begin to see how the learning you have done in this course relates to the practicalities of reading and understanding Latin.\nAim to set aside around 2 hours to work through the ‘Words’ and ‘Sentences’ sections. Once more, in line with the ‘little and often’ approach you are advised to adopt for learning Latin, you may wish to break down your time working on these sections into small chunks of 10−20 minutes."
            },
            {
                "title": "5.1 The cases in Latin",
                "content": "5.1 The cases in Latin\nTo finish off your study of ‘Getting Started on Classical Latin’, let’s take a brief look at a key feature of Latin grammar: ‘cases’.\n‘Cases’ indicate the various functions that nouns, pronouns and adjectives can have in a sentence. The case is shown by the word ending in Latin.\nDuring your work on the Introducing Classical Latin\nwebsite, you met the two most important cases in Latin. These are the nominative case (i.e. the subject forms, like servus and femina) and the accusative case (i.e. the object forms, like serv um and femin am)."
            },
            {
                "title": "Conclusion",
                "content": "Conclusion\nWe hope that you have enjoyed ‘Getting started on classical Latin’.\nSimply by working through this free course, you have already begun to familiarise yourself with some of the key terms that you will meet again if you choose to learn Latin in earnest, such as ‘noun’, ‘verb’, ‘subject’ and ‘object’. Do bear in mind that you have been presented with a lot of information in a very short time and you are certainly not expected to retain everything that you have read. Getting to grips with the basic principles of grammar – which you have already done – is always going to be more important than memorising the precise terms used to describe grammatical concepts. And the good news is that when you meet these grammatical concepts again when you are studying Latin, your understanding will give you an important head start. Remember, too, that this course has a Glossary if you need to refresh your memory of what certain grammatical terms mean.\nFocusing on grammar is one aspect of language learning, but learning vocabulary is equally important; something else that we hope you have taken away from this course is just how strong the links between Latin and English are and, as a consequence, how similar many Latin words are to English words. You might like to take a moment to reflect on how many Latin words you are familiar with now that you’ve worked through this course.\nIf you enjoyed ‘Getting Started on classical Latin’, why not take your learning further?\nIf you would like to continue your learning of classical languages, you can try:\nDiscovering Ancient Greek and Latin\nIntroducing Ancient Greek\nHere are some other options for exploring the classical world further:\nIntroducing Virgil’s Aeneid\nLatin graffiti at Pompeii\nIntroducing the Classical World\nHadrian: The Roamin’ Emperor"
            },
            {
                "title": "Glossary",
                "content": "Glossary\naccusative (case)\nThe case of the direct object of the verb; e.g. vir feminam amat, ‘the man loves the woman ; or puer servum videt, ‘the boy sees the slave ’. The accusative is also used with certain prepositions.\nadjective\nA ‘describing word’: that is to say, a word that modifies (i.e. describes) a noun; e.g. beautiful, brave, large.\nadverb\nA word which modifies (describes the action of) a verb. In English, adverbs commonly, but not always, end in – ly, e.g. quickly, suddenly, but also soon, always, almost. Adverbs can also modify an adjective or another adverb: almost ready; really easily.\nagreement\nIn the case of verbs, agreement means the change in the form of the verb depending on the verb’s subject. Thus in the sentence ‘I do’, ‘do’ agrees with ‘I’; in the sentence ‘he does’, ‘does’ agrees with ‘he’. In the case of adjectives, agreement means the change in the form of the adjective to match the number, gender and case of the noun: thus vir parv us, ‘the small man’, but femina parv a, ‘the small woman’.\ncase\nLatin nouns are found in one of six cases: nominative, accusative, genitive, dative, ablative and vocative.\nclause\nA section of a sentence containing, as a minimum, a subject and a verb (though in Latin, unlike English, the subject is not always stated).\ncomplement\nA word or phrase which adds to the description of the subject of a sentence (and which, therefore, like the subject, appears in the nominative case). A complement is most often found in conjunction with the verb ‘to be’. Thus in the sentence ‘vir est amicus’, ‘The man is a friend’, the subject is vir, ‘man’ (‘The man is …’) whereas amicus, ‘friend’, is the complement (‘… a friend’).\nconjunction\nA word that links parts of a sentence; e.g. and, but, since, because.\nending\nThe letters added to the stem of a noun, verb or adjective, for example, in order to mark number and so on. Thus the ending of ama nt, ‘they love’, indicates that the verb is third person plural (‘they’).\nfeminine\nOne of the three genders of nouns (and adjectives) in Latin. Examples of feminine nouns are femina, ‘woman’, regina, ‘queen’, and statua, ‘statue’.\nfuture tense\nThe future tense describes an action that will happen in the future; e.g. ‘I shall carry’, ‘she will listen’.\ngender\nNouns (and adjectives) in Latin are one of three genders: masculine, feminine or neuter.\nimperfect tense\nThe tense used to describe ongoing, repeated, or habitual actions in the past; e.g. portabat, ‘he was carrying’, ‘he used to carry’, ‘he kept carrying’ or just ‘he carried’ (when the ‘carrying’ went on regularly in the past: ‘He carried his shopping home every day’).\ninflection (inflected)\nThe way in which words change shape to convey information about their precise meaning and/or their grammatical role in a sentence (e.g. English ‘he’/‘him’, ‘is’/‘are’, ‘desk’/‘desks’, ‘look’/‘looked’). Languages like Latin that rely heavily on inflection to convey meaning are often called ‘inflected languages’.\ninterjection\nA word or phrase that is not connected grammatically to the rest of the sentence and which is used to convey emotion; e.g. hey ! oh dear ! alas ! whoops ! wow !\nmasculine\nOne of the three genders of Latin nouns (and adjectives) in Latin. Examples of masculine nouns are amicus, ‘friend’, servus, ‘slave’ and vir, ‘man’.\nneuter\nOne of the three genders of nouns (and adjectives) in Latin. Examples of neuter nouns are aurum, ‘gold’, and forum, ‘forum, market place’.\nnominative (case)\nThe case of the subject of the verb; e.g. femina virum amat, ‘ The woman loves the man’.\nnoun\nA person, animal, place, thing, event, idea or concept; e.g. puer, ‘boy’; Roma, ‘Rome’; statua, ‘statue’; campus, ‘field’; imperium, ‘power’; virtus, ‘courage, virtue’.\nnumber\nWhether a noun, verb, pronoun or adjective is singular or plural.\nobject (also known as direct object)\nThe person in a sentence to whom the action of the verb is being done (or the thing to which the action is being done). In the sentence ‘The man carries the soldier’, for example, ‘the man’ is the subject, ‘carries’ the verb and ‘the soldier’ is the direct object (i.e. it is the soldier who is on the receiving end of the carrying). (In Latin, the direct object of a verb appears in the accusative case.)\npart of speech\nWhether a word is a verb, noun, pronoun, adjective, adverb, preposition, conjunction or interjection.\nperson\nThe form of a verb will differ according to the ‘person’. There are three ‘persons’ in both English and Latin: first person (‘I’ and ‘we’), second person (‘you’, either singular or plural) and third person (‘he’, ‘she’, ‘it’; ‘they’).\npluperfect tense\nThe pluperfect is the tense used to show that an action took place before another action in the past. The Latin pluperfect can usually be translated into English using ‘had ____ed’, e.g. portaveram, ‘I had carried’; amaverant, ‘they had loved’.\npreposition\nA word which accompanies a noun (or a pronoun) to provide information such as the location of the action of a sentence in space or time; e.g. in, towards, against, with, among, from, after, about.\npresent tense\nThe tense used to indicate that the action of a verb is either happening right now (e.g. ‘I am running to school’) or regularly happens at the current time (e.g. ‘I run to school every day’, or ‘I do run …’). In Latin, ‘I am running’, ‘I run’ and ‘I do run’ are all expressed by the same word: curro.\npronoun\nA word which (effectively) replaces a noun or a noun phrase: this, that, he, she, it, we, they. ‘Look at the ship, it ’s enormous!’; ‘My parents? They ’re retired now.’\nsentence\nA group of words which combine according to grammatical rules to express a statement, question, wish or command. A sentence usually contains at least one verb.\nsingular\nIn the case of nouns, pronouns and adjectives, ‘singular’ is when one is meant (as opposed to more than one); e.g. amic us, ‘friend’ (as opposed to amic i, ‘friends’). In the case of verbs, a singular subject indicates that one rather than more than one person (or thing) is performing the action of the verb; e.g. ama t, ‘he/she/it loves’ (as opposed to ama nt, ‘they love’).\nsubject\nThe person or thing performing the action of the verb in a clause. (In Latin, the subject is found in the nominative case.)\ntense\nVerbs in English and Latin have tenses; e.g. present, imperfect, perfect, pluperfect. The tense of the verb indicates when the action is performed.\nverb\nA word expressing an action, state or condition: curro, ‘I run’; dormio, ‘I sleep’; est, ‘he/she/it is’. In Latin, the dictionary form of most verbs ends in – o."
            },
            {
                "title": "References",
                "content": "References\nBarker, P. (1993) Latin in our Language, Bristol, Bristol Classical Press.\nDryden, J. (1681) ‘Absalom and Achitophel’, in Kinsley, J. (ed.) The Poems and Fables of John Dryden, Oxford, Oxford University Press (this edition 1970).\nThe Holy Bible (1952 edn) Revised Standard Version, New York, Glasgow and Toronto, William Collins Sons & Co. Ltd for SPCK.\nJohnson, S. (1738) ‘London’, in Rudd, N. (ed.) Johnson’s Juvenal: London and The Vanity of Human Wishes , Bristol, Bristol Classical Press (this edition 1981).\nLuke 15: 14−18, Revised standard version of the bible.\nMarlowe, C. ( c.1589 or c.1593) Doctor Faustus, Oxford, Oxford University Press (this edition 1995).\nMilton, J. (1638) ‘Lycidas’, in Bush, D. (ed.) Milton: Poetical Works, Oxford, Oxford University Press (this edition 1969).\nMilton, J. (1667) ‘Paradise Lost’, in Bush, D. (ed.) Milton: Poetical Works, Oxford, Oxford University Press (this edition 1969).\nPope, A. (1712) The Rape of the Lock, Basingstoke, Macmillan (this edition 1998).\nPotter, B. (1902) The Tale of Peter Rabbit, London, Frederick Warne.\nShakespeare, W. (1599) ‘Julius Caesar’, in Greenblatt, S., Cohen, W., Howard, J.E. and Maus, K.E. (eds) The Norton Shakespeare, London, W.W. Norton & Company (this edition 1997).\nSuetonius, The Twelve Caesars, trans. R Graves (1979) Harmondsworth, Penguin."
            },
            {
                "title": "Further reading",
                "content": "Further reading\nIf you would like to explore the links between Latin and English further, you will find the following book useful:\nBarker, P. (1993) Latin in our Language, Bristol, Bristol Classical Press.\nAnd if you would like to begin learning Latin on your own, the following books are recommended:\nJones, P.V. (1997) Learn Latin: The Book of the Daily Telegraph Series , London, Duckworth.\nSharpley, G.D.A. (2014) Get Started in Latin, London, Hodder & Stoughton.\nSharpley, G.D.A. (2014) The Complete Latin Course, London/New York, Routledge."
            },
            {
                "title": "Acknowledgements",
                "content": "Acknowledgements\nThis free course was written by Inga Mantle, James Robson and Jeremy Taylor.\nExcept for third party materials and otherwise stated (see terms and conditions\n), this content is made available under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 Licence  .\nThe material acknowledged below is Proprietary and used under licence (not subject to Creative Commons Licence). Grateful acknowledgement is made to the following sources for permission to reproduce material in this free course:\nEvery effort has been made to contact copyright owners. If any have been inadvertently overlooked, the publishers will be pleased to make the necessary arrangements at the first opportunity.\nIf reading this text has inspired you to learn more, you may be interested in joining the millions of people who discover our free learning resources and qualifications by visiting The Open University – www.open.edu/ openlearn/ free-courses.\nCourse image: The Roman poet Virgil depicted in a fifth century CE manuscript (the Vergilius Romanus) of his poetical works, the Eclogues. Biblioteca Apostolica, Vatican City. Photo: © The Art Archive/Alamy.\nEvery effort has been made to contact copyright owners. If any have been inadvertently overlooked, the publishers will be pleased to make the necessary arrangements at the first opportunity.\nDon't miss out\nIf reading this text has inspired you to learn more, you may be interested in joining the millions of people who discover our free learning resources and qualifications by visiting The Open University – www.open.edu/ openlearn/ free-courses."
            }
        ],
        "url": "https://www.open.edu/openlearn/history-the-arts/getting-started-on-classical-latin/content-section-0?active-tab=description-tab"
    },
    {
        "title": "Everyday English 1",
        "description": "Languages",
        "category": "Languages",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/languages/everyday-english-1/content-section-overview?active-tab=description-tab"
    },
    {
        "title": "Sperm counts",
        "description": "Nature & Environment",
        "category": "Nature & Environment",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/nature-environment/natural-history/sperm-counts"
    },
    {
        "title": "Understanding autism",
        "description": "Science, Maths & Technology",
        "category": "Science, Maths & Technology",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/science-maths-technology/understanding-autism/content-section-overview?active-tab=description-tab"
    },
    {
        "title": "Legal skills and debates in Scotland",
        "description": "Society, Politics & Law",
        "category": "Society, Politics & Law",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/society-politics-law/law/legal-skills-and-debates-scotland/content-section-overview?active-tab=description-tab"
    },
    {
        "title": "Introduction to cyber security: stay safe online",
        "description": "Digital & Computing",
        "category": "Digital & Computing",
        "chapters": [],
        "url": "https://www.open.edu/openlearn/digital-computing/introduction-cyber-security-stay-safe-online/content-section-overview?active-tab=description-tab"
    }
]